import { EventItem } from "../types/event";

export const initialEvents: EventItem[] = [
  {
    id: "evt-1",
    title: "Хакатон з мобільної розробки",
    date: "25.10, 10:00",
    place: "Аудиторія 304 / Google Meet",
    category: "Навчання",
    description:
      "Змагання зі створення React Native застосунків за 6 годин. Запрошуються студенти 2-4 курсів.",
  },
  {
    id: "evt-2",
    title: "Осінній акустичний вечір",
    date: "28.10, 17:00",
    place: "Актова зала коледжу",
    category: "Культура",
    description:
      "Затишний музичний вечір авторської пісні та поезії за участю студентів і викладачів.",
  },
  {
    id: "evt-3",
    title: "Турнір з настільного тенісу",
    date: "02.11, 15:00",
    place: "Спортивний зал №1",
    category: "Спорт",
    description:
      "Міжкафедральний чемпіонат з настільного тенісу. Переможці отримають кубки та памʼятні призи.",
  },
  {
    id: "evt-4",
    title: "Гостьова лекція: Senior React Developer",
    date: "05.11, 14:00",
    place: "Аудиторія 101",
    category: "Навчання",
    description:
      'Тема: "Сучасні тренди у Frontend-розробці". Розбір реальних кейсів та сесія запитань-відповідей.',
  },
];
